/*
*********************************************************************************************************
*
*	模块名称 : 蜂鸣器驱动模块
*	文件名称 : bsp_beep.c
*	版    本 : Vx.x
*	说    明 : 
*
*	修改记录 :
*		版本号  日期   240301     作者   王寅骁  说明
*		V1.0    20xx-xx-xx waroyal  正式发布
*
*	Copyright (C), 2014-2024, 德致伦电子
*
*********************************************************************************************************
*/

///////////////////////////////////////
/* 头文件包含区 */
#include "bsp.h"
///////////////////////////////////////
/* 变量定义区 */

///////////////////////////////////////
/* 外部变量申明区 */

///////////////////////////////////////
/* 函数申明区 */

///////////////////////////////////////
/* 函数实体区 */

/*
*********************************************************************************************************
*	函 数 名: bsp_InitBeep
*	功能说明: 配置有源蜂鸣器相关的GPIO，该函数被 bsp_Init() 调用
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitBeep(void)
{
	//1.定义结构体
	GPIO_InitTypeDef GPIO_InitStruct;
	
	//2.打开时钟
	RCC_APB2PeriphClockCmd(RCC_ALL_BEEP,ENABLE);
	
	//3.结构体赋值
	GPIO_InitStruct.GPIO_Pin = BEEP_GPIO_PIN;			//BEEP引脚号
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_Out_PP;		//通用推挽输出
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;		//输出用speed
	
	//4.GPIO_Init初始化
	GPIO_Init(BEEP_GPIO_PORT,&GPIO_InitStruct);
	
	//5.初始电平设置
	GPIO_ResetBits(BEEP_GPIO_PORT,BEEP_GPIO_PIN);		//		
}

/*
*********************************************************************************************************
*	函 数 名: bsp_BeepOn
*	功能说明: 打开蜂鸣器
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_BeepOn(void)
{
	//位带
	BEEP = 1;
}

/*
*********************************************************************************************************
*	函 数 名: bsp_BeepOff
*	功能说明: 关闭蜂鸣器
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_BeepOff(void)
{
	//库函数
	GPIO_ResetBits(BEEP_GPIO_PORT,BEEP_GPIO_PIN);
}

/*
*********************************************************************************************************
*	函 数 名: bsp_BeepToggle
*	功能说明: 翻转蜂鸣器
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_BeepToggle(void)
{
	BEEP_GPIO_PORT->ODR ^= BEEP_GPIO_PIN;
}

/*
*********************************************************************************************************
*	函 数 名: bsp_IsBeepOn
*	功能说明: 判断蜂鸣器是否已经鸣叫
*	形    参: 无
*	返 回 值: 1表示已经鸣叫，0表示静音
*********************************************************************************************************
*/
uint8_t bsp_IsBeepOn(void)
{
	if((BEEP_GPIO_PORT->ODR & BEEP_GPIO_PIN) == BEEP_GPIO_PIN)
	{
		return 1;
	}
	return 0;
}

///////////////////////////////////////

/***************************** 德致伦电子 DeZLinc (END OF FILE) *********************************/
