/*
*********************************************************************************************************
*
*	模块名称 : 风扇驱动模块
*	文件名称 : bsp_Fan.c
*	版    本 : Vx.x
*	说    明 : 
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2024-05-29  waroyal  正式发布
*
*	Copyright (C), 2014-2024, 德致伦电子
*
*********************************************************************************************************
*/

///////////////////////////////////////
/* 头文件包含区 */
#include "bsp.h"

///////////////////////////////////////
/* 变量定义区 */

///////////////////////////////////////
/* 外部变量申明区 */

///////////////////////////////////////
/* 函数申明区 */

///////////////////////////////////////
/* 函数实体区 */
/*
*********************************************************************************************************
*	函 数 名: bsp_InitFan
*	功能说明: 配置风扇相关的GPIO
*	形    参: void
*	返 回 值: void
*********************************************************************************************************
*/
void bsp_InitFan(void)
{
	//1.定义结构体
	GPIO_InitTypeDef GPIO_InitStructure;
	
	//2.打开时钟
	RCC_APB2PeriphClockCmd(RCC_ALL_FAN,ENABLE);
	
	//初始化为断开
	bsp_FanOff(1);
	bsp_FanOff(2);
	
	//3.结构体赋值
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	//Fan1
	GPIO_InitStructure.GPIO_Pin = FAN1_GPIO_PIN;
	GPIO_Init(FAN1_GPIO_PORT,&GPIO_InitStructure);
	//Fan2
	GPIO_InitStructure.GPIO_Pin = FAN2_GPIO_PIN;
	GPIO_Init(FAN2_GPIO_PORT,&GPIO_InitStructure);
}

/*
*********************************************************************************************************
*	函 数 名: bsp_FanOn
*	功能说明: 打开风扇
*	形    参: uint8_t _no:风扇序号
*	返 回 值: void
*********************************************************************************************************
*/
void bsp_FanOn(uint8_t _no)
{
	if(_no==1)
	{
		FAN1=1;
	}
	else if(_no==2)
	{
		FAN2=1;
	}
}

/*
*********************************************************************************************************
*	函 数 名: bsp_FanOff
*	功能说明: 关闭风扇
*	形    参: uint8_t _no:风扇序号
*	返 回 值: void
*********************************************************************************************************
*/
void bsp_FanOff(uint8_t _no)
{
	if(_no==1)
	{
		FAN1=0;
	}
	else if(_no==2)
	{
		FAN2=0;
	}
}

/*
*********************************************************************************************************
*	函 数 名: bsp_FanToggle
*	功能说明: 翻转指定风扇
*	形    参: uint8_t _no:继电器序号
*	返 回 值: void
*********************************************************************************************************
*/
void bsp_FanToggle(uint8_t _no)
{
	if(_no==1)
	{
		FAN1_GPIO_PORT->ODR ^= FAN1_GPIO_PIN;
	}
	else if(_no==2)
	{
		FAN2_GPIO_PORT->ODR ^= FAN2_GPIO_PIN;
	}
}

/*
*********************************************************************************************************
*	函 数 名: bsp_IsFanOn
*	功能说明: 判断风扇是否打开
*	形    参: uint8_t _no:风扇序号
*	返 回 值: 1-打开 0-关闭
*********************************************************************************************************
*/
uint8_t bsp_IsFanOn(uint8_t _no)
{
	if(_no==1)
	{
		if((FAN1_GPIO_PORT->ODR&FAN1_GPIO_PIN)==FAN1_GPIO_PIN) return 1;
		return 0;
	}
	else if(_no==2)
	{
		if((FAN2_GPIO_PORT->ODR&FAN2_GPIO_PIN)==FAN2_GPIO_PIN) return 1;
		return 0;
	}
	
	return 0;
}








///////////////////////////////////////

/***************************** 德致伦电子 DeZLinc (END OF FILE) *********************************/
